## Plan Result (Network_sbox - DeployInfrastructure)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.network.azurerm_subnet.additional_subnets[&#34;infra-appgws&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.network.azurerm_subnet.additional_subnets["infra-appgws"] will be created
  + resource "azurerm_subnet" "additional_subnets" {
      + address_prefixes                               = [
          + "10.2.16.0/25",
        ]
      + enforce_private_link_endpoint_network_policies = true
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "infra-appgws"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "cft-sbox-network-rg"
      + virtual_network_name                           = "cft-sbox-vnet"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":692,"Program":"tfcmt","SHA1":"","Target":"Network_sbox - DeployInfrastructure","Vars":{}} -->